{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "/home/lgd/common/ComfyUI/models/LLM/opengvlab/internvl2-8b",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [],
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "w3",
    "fc2",
    "mlp1.3",
    "mlp1.1",
    "wqkv",
    "w1",
    "output",
    "w2",
    "wo",
    "proj",
    "fc1",
    "qkv"
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}